Repository: sailfishos-mirror/volume_key
Catalog: po/*.po
Languages: ka

source: Unable to find the certificate necessary for decryption
ka: გაშიფვრისთვის საჭირო სერტიფიკატი ვერ ვიპოვე

source: Unknown error getting encryption result
ka: დაშიფვრის შედეგის მიღების უცნობი შეცდომა

source: Unknown error getting decryption result
ka: გაშიფვრის შედეგის მიღების უცნობი შეცდომა

source: Not enough space provided to store a KMIP packet
ka: KMIP პაკეტის დასამახსოვრებლად მოწოდებული ადგილი საკმარისი არაა

source: A string is too long
ka: სტრიქონი ძალიან გრძელია

source: Binary data is too long
ka: ბინარული მონაცემები ძალიან გრძელია

source: A KMIP structure is too long
ka: KMIP სტრუქტურა ძალიან დიდია

source: Unexpected end of data
ka: მონაცემების მოულოდნელი დასასრული

source: Unexpected item tag 0x%08lX
ka: მოულოდნელი ელემენტის ჭდე 0x%08lX

source: Unexpected item type 0x%02X
ka: მოულოდნელი ელემენტის ტიპი 0x%02X

source: Unexpected item size
ka: მოულოდნელი ელემენტის ზომა

source: Unsupported enum value %s
ka: მხარდაუჭერელი ჩამონათვალის მნიშვნელობა %s

source: String item expected, got %02X
ka: მოველოდი სტრიქონს, მივიღე %02X

source: Structure does not fit in its container
ka: სტრუქტურა მის კონტეინერში არ ეტევა

source: Unexpected data in structure
ka: მოულოდნელი მონაცემები სტრუქტურაში

source: Number of key bits is not positive
ka: გასაღების ბიტების რაოდენობა დადებითი არაა

source: Wrapped key is not opaque
ka: გადატანილი გასაღები გაუმჭვირვალე არაა

source: Unsupported symmetric key format %s
ka: მხარდაუჭერელი სიმეტრიული გასაღების ფორმატი %s

source: Unsupported KMIP version %s.%s
ka: მხარდაუჭერელი KMIP ვერსია %s.%s

source: Unsupported object type %s
ka: ობიექტის მხარდაუჭერელი ტიპი %s

source: Unexpected data after packet
ka: მხარდაუჭერელი მონაცემები პაკეტის შემდეგ

source: Unsupported packet type %s
ka: მხარდაუჭერელი პაკეტის ტიპი %s

source: Unsupported mechanism %lu
ka: მხარდაუჭერელი მექანიზმი %lu

source: Unexpected wrapped key format
ka: მოულოდნელი გადატანილი გასაღების ფორმატი

source: Unsupported wrapping mechanism
ka: მხარდაუჭერელი გადატანის მექანიზმი

source: Unsupported asymmetric encryption format
ka: მხადაუჭერელი ასიმეტრიული დაშიფვრის ფორმატი

source: Input packet is too small
ka: შეტანის პაკეტები მეტისმეტად მცირეა

source: Input is not a volume_key escrow packet
ka: შეყვანილი მონაცემები volume_key-ის escrow პაკეტი არაა

source: Unsupported packet format
ka: მხარდაუჭერელი პაკეტის ფორმატი

source: Escrow packet passphrase
ka: Escrow პაკეტის საკვანძო ფრაზა

source: Too many attempts to get a valid passphrase
ka: სწორი საკვანძო ფრაზის მიღების მეტისმეტად ბევრი მცდელობა

source: Too many attempts to get a valid symmetric key
ka: სწორი სიმეტრიული ფრაზის მიღების მეტისმეტად ბევრი მცდელობა

source: The packet metadata is encrypted
ka: პაკეტის მეტამონაცემები დაშიფრულია

source: User interface callbacks not provided
ka: მომხმარებლის ინტერფეისის უკუგამოძახებები მოწოდებული არაა

source: Passphrase not provided
ka: საკვანძო ფრაზა მოწოდებული არაა

source: Symmetric key callback not provided
ka: სიმეტრიული გასაღების უკუგამოძახება მოწოდებული არაა

source: Symmetric key not provided
ka: სიმეტრიული გასაღები მოწოდებული არაა

source: The key is too long
ka: გასაღები მეტისმეტად დიდია

source: Required attribute `%s' not found
ka: აუცილებელი ატრიბუტი '%s' ვერ ვიპოვე

source: Cannot get attributes of `%s'
ka: '%s'-ს ატრიბუტების მიღება შეუძლებელია

source: Host name
ka: ჰოსტის სახელი

source: Volume format
ka: ტომის ფორმატი

source: Volume UUID
ka: ტომის UUID

source: Volume label
ka: ტომის ჭდე

source: Volume path
ka: ტომის ბილიკი

source: Volume `%s' has unsupported format
ka: ტომის '%s' ფორმატი მხარდაჭერილი არაა

source: Volume format mismatch (packet `%s', volume `%s')
ka: ტომის ფორმატი არ ემთხვევა (პაკეტი '%s', ტომი '%s')

source: UUID mismatch (packet `%s', volume `%s')
ka: UUID არ ემთხვევა (პაკეტი '%s', ტომი '%s')

source: Host name mismatch (packet `%s', volume `%s')
ka: ჰოსტის სახელი არ ემთხვევა (პაკეტი '%s', ტომი '%s')

source: Volume label mismatch (packet `%s', volume `%s')
ka: ტომის ჭდე არ ემთხვევა (პაკეტი '%s', ტომი '%s')

source: Volume path mismatch (packet `%s', volume `%s')
ka: ტომის ბილიკი არ ემთხვევა (პაკეტი '%s', ტომი '%s')

source: Unsupported volume format `%s'
ka: მხარდაუჭერელი ტომის ფორმატი '%s'

source: Unknown error %d
ka: უცნობი შეცდომა %d

source: Error getting information about volume `%s':
ka: შეცდომა ინფორმაციის მიღებისას ტომზე '%s':

source: UUID mismatch between libblkid and libcryptsetup: `%s' vs. `%s'
ka: UUID არ ემთხვევა ბიბლიოთეკებისთვის libblkid და libcryptsetup: `%s' vs. `%s'

source: LUKS cipher name
ka: LUKS შიფრის სახელი

source: LUKS cipher mode
ka: LUKS შიფრის რეჟიმი

source: Key size (bits)
ka: გასაღების ზომა (ბიტებში)

source: Data encryption key
ka: მონაცემების დაშიფვრის გასაღები

source: Passphrase
ka: კოდური ფრაზა

source: Passphrase slot
ka: საკვანძო ფრაზის სლოტი

source: Encryption information type unsupported in LUKS
ka: დაშიფვრის ინფორმაციის ტიპი LUKS-ში მხარდაჭერილი არაა

source: Passphrase for `%s'
ka: საკვანძო ფრაზა '%s'-სთვის

source: Error getting LUKS data encryption key:
ka: შეცდომა LUKS-ის მონაცემების დაშიფვრის გასაღების მიღებისას:

source: Cipher name mismatch (packet `%s', volume `%s')
ka: შიფრის სახელი არ ემთხვევა (პაკეტი '%s', ტომი '%s')

source: Cipher mode mismatch (packet `%s', volume `%s')
ka: შიფრის რეჟიმი არ ემთხვევა (პაკეტი '%s', ტომი '%s')

source: Key size mismatch (packet %zu, volume %zu)
ka: გასაღების ზომა არ ემთხვევა (პაკეტი %zu ტომი %zu)

source: LUKS data encryption key in packet is invalid:
ka: LUKS-ის მონაცემების დაშიფვრის გასაღები პაკეტში არასწორია:

source: LUKS passphrase in packet is invalid:
ka: LUKS-ის საკვანძო ფრაზა პაკეტში არასწორია:

source: Escrow packet does not contain the LUKS data encryption key
ka: Escrow პაკეტი LUKS-ის მონაცემების დაშიფვრის გასაღებს არ შეიცავს

source: New passphrase for `%s'
ka: ახალი საკვანძო ფრაზა '%s'-სთვის

source: Repeat new passphrase for `%s'
ka: გაიმეორეთ ახალი საკვანძო ფრაზა '%s'-სთვის

source: Passphrases do not match. New passphrase for `%s'
ka: საკვანძო ფრაზები არ ემთხვევა. ახალი საკვანძო ფრაზა '%s'-სთვის

source: Too many attempts to get a passphrase
ka: საკვანძო ფრაზების მიღების მეტისმეტად ბევრი მცდელობა

source: Error adding a LUKS passphrase
ka: LUKS საკვანძო ფრაზის დამატების შეცდომა

source: Can not add a secret of this type
ka: ამ ტიპის საიდუმლოს ვერ დავამატებ

source: Data encryption key unknown
ka: მონაცემების დაშიფვრის გასაღები უცნობია

source: The passphrase must be a string
ka: საკვანძო ფრაზა სტრიქრონი უნდა იყოს

source: Passphrase unknown
ka: საკვანძო ფრაზა უცნობია

source: Unsupported key length %s
ka: მხარდაუჭერელი გასაღების სიგრძე %s

source: Key length mismatch
ka: გასაღების სიგრძე არ ემთხვევა

source: Invalid slot number `%s'
ka: არასწორი სლოტის ნომერი '%s'

source: NUL byte in passphrase
ka: ნულოვანი ბაიტი საკვანძო ფრაზაში

source: Error opening LUKS volume:
ka: შეცდომა LUKS ტომის გახსნისას:

source: Error decoding certificate
ka: შეცდომა სერტიფიკატის დეკოდირებისას

source: %s (y/n)
ka: %s (y(დიახ)/n(არა))

source: Show version
ka: ვერსიის ჩვენება

source: Save volume secrets to a packet. Expects operands VOLUME [PACKET].
ka: ტომის საიდუმლოების პაკეტში შენახვა. ელოდება ოპერანდს ტომი [პაკეტი].

source: Restore volume secrets from a packet. Expects operands VOLUME PACKET.
ka: ტომის საიდუმლოების აღდგენა პაკეტიდან. მოელის ოპერანდებს ტომი პაკეტი.

source: Set up an encrypted volume using secrets from a packet. Expects operands VOLUME PACKET NAME.
ka: მოირგებს დაშიფრულ ტომს პაკეტიდან მიღებული საიდუმლოს გამოყენებით. მოელის ოპერანდებს ტომი პაკეტი სახელი.

source: Re-encrypt an escrow packet. Expects operand PACKET.
ka: Escrow პაკეტის თავიდან დაშიფვრა. მოელის ოპერანდს პაკეტი.

source: Show information contained in a packet. Expects operand PACKET.
ka: პაკეტში არსებული ინფორმაციის ჩვენება. მოელის ოპერანდს პაკეტი.

source: Show secrets contained in a packet. Expects operand PACKET.
ka: პაკეტში არსებული საიდუმლოების ჩვენება. მოელის ოპერანდს პაკეტი.

source: Use the NSS database in DIR
ka: NSS მონაცემთა ბაზის გამოყენება მითითებული საქაღალდიდან

source: DIR
ka: საქაღალდე

source: Run in batch mode
ka: ერთზე მეტის გაშვება

source: Write the default secret to PACKET
ka: ნაგულისხმევი საიდუმლოს ჩაწერა მითითებულ პაკეტში

source: PACKET
ka: პაკეტი

source: Write data encryption key to PACKET
ka: მონაცემების დაშიფვრის ჩაწერა მითითებულ პაკეტში

source: Write passphrase to PACKET
ka: საკვანძი ფრაზის ჩაწერა მითითებულ პაკეტში

source: Create a random passphrase and write it to PACKET
ka: შემთხვევითი საკვანძო ფრაზის შექმნა და მისი ჩაწერა მითითებულ პაკეტში

source: Encrypt for the certificate in CERT
ka: სერტიფიკატის დაშიფვრა მითითებულ სერტიფიკატში

source: Use FORMAT for all output packets
ka: მითითებული ფორმატის გამოყენება ყველა გამოტანილი პაკეტისთვის

source: FORMAT
ka: ფორმატი

source: Only include unencrypted information, if any, in --dump
ka: მხოლოდ დაუშიფრავი ინფორმაციის ჩასმა, თუ ასეთი არსებობს, --dump-ში

source: Include secrets in --dump output
ka: --dump-ის გამოტანილ ინფორმაციაში საიდუმლოებების ჩასმა

source: OPERANDS
ka: ოპერანდები

source: Manages encrypted volume keys and passphrases.
ka: მართავს დაშიფრულ ტომის გასაღებებს და საკვანძო ფრაზებს.

source: Report bugs to %s
ka: შეცდომების შესახებ მიწერეთ: %s

source: %s: %s Run `%s --help' for more information.
ka: %s: %s მეტი ინფორმაციისთვის გამოიყენეთ `%s --help'.

source: Copyright (C) 2009 Red Hat, Inc. All rights reserved. This software is distributed under the GPL v.2. This program is provided with NO WARRANTY, to the extent permitted by law.
ka: საავტორო უფლებები (C) 2009 Red Hat, Inc. ყველა უფლება დაცულია. ეს პროგრამა ვრცელდება ლიცენზიით GPL v.2. პროგრამა მოწოდებულია გარანტიის გარეშე იმ დონეზე, რის უფლებასაც კანონი გვაძლევს.

source: Operation mode not specified
ka: ოპერაციის რეჟიმი მითითებული არაა

source: Ambiguous operation mode
ka: ბუნდოვანი ოპერაციის რეჟიმი

source: `--%s' is only valid with `--%s'
ka: `--%s', მხოლოდ, `--%s'-სთან ერთადაა სწორ

source: Output can be specified only with `--save' or `--reencrypt'
ka: გამოტანის მითითება, მხოლოდ, `--save' ან `--reencrypt' პარამეტრებთან ერთად შეგიძლიათ

source: No output specified
ka: გამოტანა მითითებული არაა

source: Ambiguous output format
ka: ბუნდოვანი გამოტანის ფორმატი

source: Unknown packet format `%s'
ka: უცნობი პაკეტის ფორმატი '%s'

source: Output format does not match other options
ka: გამოტანის ფორმატი დანარჩენ პარამეტრებს არ ემთხვევა

source: Error, try again.
ka: შეცდომა. კიდევ სცადეთ.

source: Enter password for `%s':
ka: შეიყვანეთ პაროლი %s-სთვის:

source: Error reading `%s':
ka: შეცდომა '%s'-ის კითხვისას:

source: Error decoding `%s':
ka: შეცდომა '%s'-ის დეკოდირებისას:

source: New packet passphrase
ka: ახალი პაკეტის საკვანძო ფრაზა

source: Passphrases do not match. New packet passphrase
ka: საკვანძო ფრაზები არ ემთხვევა. ახალი პაკეტის საკვანძო ფრაზა

source: Repeat new packet passphrase
ka: გაიმეორეთ ახალი პაკეტის საკვანძო ფრაზა

source: Error creating `%s':
ka: '%s'-ის შექმნის შეცდომა:

source: Error generating passphrase: %s
ka: საკვანძო ფრაზის გენერაციის შეცდომა: %s

source: Usage: %s --save VOLUME [PACKET]
ka: გამოყენება: %s --save ტომი [პაკეტი]

source: Error opening `%s': %s
ka: '%s'-ის გახსნის შეცდომა: %s

source: Error loading `%s': %s
ka: '%s'-ის ჩატვირთვის შეცდომა: %s

source: Error creating a passphrase: %s
ka: საკვანძო ფრაზს შექმნის შეცდომა: %s

source: `%s' does not match `%s':
ka: `%s' და `%s' არ ემთხვევა:

source: `%s' perhaps does not match `%s'
ka: '%s', სავარაუდოდ, '%s'-ს არ ემთხვევა

source: Are you sure you want to use this packet?
ka: დარწმუნებული ბრძანდებით, რომ გნებავთ, გამოიყენოთ ეს პაკეტი?

source: Error getting a yes/no answer
ka: შეცდომა yes(დიახ)/no(არა) პასუხის მიღებისას

source: Usage: %s --%s VOLUME PACKET
ka: გამოყენება: %s --%s ტომი პაკეტი

source: Error restoring access to `%s': %s
ka: '%s'-ზე წვდომების აღდგენის შეცდომა: %s

source: Usage: %s --%s VOLUME PACKET NAME
ka: გამოყენება: %s --%s ტომი პაკეტი სახელი

source: Error setting up `%s': %s
ka: '%s'-ის მორგების შეცდომა: %s

source: Usage: %s --%s PACKET
ka: გამოყენება: %s --%s პაკეტი

source: Error reading `%s': %s
ka: შეცდომა '%s'-ის კითხვისას: %s

source: Invalid packet: %s
ka: არასწორი პაკეტი: %s

source: Unencrypted
ka: დაუშიფრავი

source: Public key-encrypted
ka: საჯარო გასაღებით დაშიფრული

source: Passphrase-encrypted
ka: საკვანძო ფრაზით დაშიფრული

source: Only secrets public key-encrypted
ka: მხოლოდ საიდუმლოებია საჯარო გასაღებით დაშიფრული

source: Only secrets symmetric key-encrypted
ka: მხოლოდ საიდუმლოებია სიმეტრიული გასაღებით დაშიფრული

source: Packet format
ka: პაკეტის ფორმატი

source: Error decoding `%s': %s
ka: '%s'-ის გაშიფვრის შეცდომა: %s
